In [1]:
# EDA(Exploratory data analysis) technical data analyst(python, matplolib,seaborn,PowerBI,tableau)

In [2]:
# EDA(Exploratory data analysis) data analyst(PowerBI, tableau)

In [3]:
# Pandas=> Panel Data

# Data of Individual, organisation or domain over a period of time.

In [4]:
import pandas as pd

In [5]:
df=pd.DataFrame({"Rollno":[1,2,3,4],"name":["Rohan","Sohan","Mohan","Tinku"]})

In [6]:
df

   Rollno   name
0       1  Rohan
1       2  Sohan
2       3  Mohan
3       4  Tinku

In [7]:
df.values

array([[1, 'Rohan'],
       [2, 'Sohan'],
       [3, 'Mohan'],
       [4, 'Tinku']], dtype=object)

In [8]:
df1=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx")   #bydefault read first sheet of excel file.
df1

   Yogesh  5.7  21
0  Saadik  5.7  21
1  Subham  5.8  25
2  Vishal  5.6  25
3  Yunush  5.6  22

In [11]:
df2=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",sheet_name='Sheet2')
df2

     Name  height(inch)  age
0  Yogesh           5.7   21
1  Saadik           5.7   21
2  Subham           5.8   25
3  Vishal           5.6   25
4  Yunush           5.6   22

In [14]:
df_dict=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",sheet_name=['Sheet1','Sheet2'])

ValueError: Worksheet named 'Sheet1' not found

In [15]:
df_dict

NameError: name 'df_dict' is not defined

In [16]:
df_dict['Sheet1']

NameError: name 'df_dict' is not defined

In [17]:
df_dict['Sheet2']

NameError: name 'df_dict' is not defined

In [18]:
df1=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",header=None)

In [19]:
df1

        0    1   2
0  Yogesh  5.7  21
1  Saadik  5.7  21
2  Subham  5.8  25
3  Vishal  5.6  25
4  Yunush  5.6  22

In [20]:
df1=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",header=1)

In [21]:
df1

   Saadik  5.7  21
0  Subham  5.8  25
1  Vishal  5.6  25
2  Yunush  5.6  22

In [22]:
df1=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",sheet_name="Rahul")

In [23]:
df1

   Yogesh  5.7  21
0  Saadik  5.7  21
1  Subham  5.8  25
2  Vishal  5.6  25
3  Yunush  5.6  22

In [24]:
df4=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",sheet_name=0)

In [25]:
df4

   Yogesh  5.7  21
0  Saadik  5.7  21
1  Subham  5.8  25
2  Vishal  5.6  25
3  Yunush  5.6  22

In [26]:
df5=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",sheet_name=1)
df5

     Name  height(inch)  age
0  Yogesh           5.7   21
1  Saadik           5.7   21
2  Subham           5.8   25
3  Vishal           5.6   25
4  Yunush           5.6   22

In [27]:
df5=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",sheet_name=2)
df5

Empty DataFrame
Columns: []
Index: []

In [28]:
df5=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",sheet_name=None)
df5

{'Rahul':    Yogesh  5.7  21
 0  Saadik  5.7  21
 1  Subham  5.8  25
 2  Vishal  5.6  25
 3  Yunush  5.6  22,
 'Sheet2':      Name  height(inch)  age
 0  Yogesh           5.7   21
 1  Saadik           5.7   21
 2  Subham           5.8   25
 3  Vishal           5.6   25
 4  Yunush           5.6   22,
 'Sheet3': Empty DataFrame
 Columns: []
 Index: []}

In [29]:
df5['Rahul']

   Yogesh  5.7  21
0  Saadik  5.7  21
1  Subham  5.8  25
2  Vishal  5.6  25
3  Yunush  5.6  22

In [30]:
df5['Sheet2']

     Name  height(inch)  age
0  Yogesh           5.7   21
1  Saadik           5.7   21
2  Subham           5.8   25
3  Vishal           5.6   25
4  Yunush           5.6   22

In [31]:
df6=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",sheet_name=0,header=None,names=["Name","Height","Age"])
df6

     Name  Height  Age
0  Yogesh     5.7   21
1  Saadik     5.7   21
2  Subham     5.8   25
3  Vishal     5.6   25
4  Yunush     5.6   22

In [32]:
df6.shape

(5, 3)

In [33]:
df6.values

array([['Yogesh', 5.7, 21],
       ['Saadik', 5.7, 21],
       ['Subham', 5.8, 25],
       ['Vishal', 5.6, 25],
       ['Yunush', 5.6, 22]], dtype=object)

In [34]:
df6=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",sheet_name=0,header=None,names=["Name","Height","Age"],nrows=2) # nrows help to get specific number of rows of df
df6

     Name  Height  Age
0  Yogesh     5.7   21
1  Saadik     5.7   21

In [35]:
df6=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",sheet_name=0,header=None,names=["Name","Height","Age"],skiprows=[0,1,2,3]) 
df6

     Name  Height  Age
0  Yunush     5.6   22

In [36]:
[i+1 for i in range(4)]

[1, 2, 3, 4]

In [37]:
df5=pd.read_excel("C:/Users/Ducat/Desktop/student_1130.xlsx",sheet_name=1)
df5

     Name  height(inch)  age
0  Yogesh           5.7   21
1  Saadik           5.7   21
2  Subham           5.8   25
3  Vishal           5.6   25
4  Yunush           5.6   22

In [38]:
pd.read_csv(r"C:\Users\Ducat\Desktop\tips (1).csv",usecols=[0,1,6])

     total_bill   tip  size
0         16.99  1.01     2
1         10.34  1.66     3
2         21.01  3.50     3
3         23.68   NaN     2
4         24.59  3.61     4
..          ...   ...   ...
239       29.03  5.92     3
240       27.18  2.00     2
241       22.67  2.00     2
242       17.82  1.75     2
243       18.78  3.00     2

[244 rows x 3 columns]

# csv

In [39]:
df=pd.read_csv(r"C:\Users\Ducat\Desktop\2.txt",header=None,names=["S.N","Name","Age","Weight"])

In [40]:
df.to_excel(r"C:\Users\Ducat\Desktop\2.xlsx")

In [41]:
import pandas as pd

In [42]:
df=pd.read_csv(r"C:\Users\Ducat\Desktop\Titanic-Dataset (1).csv")

In [43]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [44]:
import pandas as pd
df=pd.read_excel(r"C:\Users\Ducat\Desktop\weather.xlsx")

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\Ducat\\Desktop\\weather.xlsx'

In [ ]:
df

In [ ]:
df.head(1)

In [45]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [46]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [47]:
df1=pd.read_csv(r"C:\Users\Ducat\Desktop\tips (1).csv")

In [48]:
df1=df1.dropna()

In [49]:
df1

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
4         24.59  3.61  Female     No   Sun  Dinner     4
5         25.29  4.71    Male     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[242 rows x 7 columns]

In [50]:
df1.sort_values(by='total_bill')

     total_bill    tip     sex smoker   day    time  size
67         3.07   1.00  Female    Yes   Sat  Dinner     1
92         5.75   1.00  Female    Yes   Fri  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
172        7.25   5.15    Male    Yes   Sun  Dinner     2
149        7.51   2.00    Male     No  Thur   Lunch     2
..          ...    ...     ...    ...   ...     ...   ...
182       45.35   3.50    Male    Yes   Sun  Dinner     3
156       48.17   5.00    Male     No   Sun  Dinner     6
59        48.27   6.73    Male     No   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
170       50.81  10.00    Male    Yes   Sat  Dinner     3

[242 rows x 7 columns]

In [51]:
df1.sort_values(by='total_bill',ascending=False)

     total_bill    tip     sex smoker   day    time  size
170       50.81  10.00    Male    Yes   Sat  Dinner     3
212       48.33   9.00    Male     No   Sat  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
156       48.17   5.00    Male     No   Sun  Dinner     6
182       45.35   3.50    Male    Yes   Sun  Dinner     3
..          ...    ...     ...    ...   ...     ...   ...
149        7.51   2.00    Male     No  Thur   Lunch     2
111        7.25   1.00  Female     No   Sat  Dinner     1
172        7.25   5.15    Male    Yes   Sun  Dinner     2
92         5.75   1.00  Female    Yes   Fri  Dinner     2
67         3.07   1.00  Female    Yes   Sat  Dinner     1

[242 rows x 7 columns]

In [52]:
df1.sort_values(by='total_bill',ascending=False).head(3)

     total_bill    tip   sex smoker  day    time  size
170       50.81  10.00  Male    Yes  Sat  Dinner     3
212       48.33   9.00  Male     No  Sat  Dinner     4
59        48.27   6.73  Male     No  Sat  Dinner     4

In [53]:
df1.total_bill

0      16.99
1      10.34
2      21.01
4      24.59
5      25.29
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 242, dtype: float64

In [54]:
df1['total_bill']

0      16.99
1      10.34
2      21.01
4      24.59
5      25.29
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 242, dtype: float64

In [55]:
sum(df1['total_bill'])

4789.050000000001

In [56]:
sum(df1.total_bill)

4789.050000000001

In [57]:
df1['size']

0      2
1      3
2      3
4      4
5      4
      ..
239    3
240    2
241    2
242    2
243    2
Name: size, Length: 242, dtype: int64

In [58]:
df1.s

AttributeError: 'DataFrame' object has no attribute 's'

In [ ]:
sum(df1['size'])

In [ ]:
df1

In [ ]:
242*7

In [ ]:
sum(df1['total_bill'])

In [ ]:
bill=df1['total_bill']

In [ ]:
bill.sum()

In [ ]:
import numpy as np

In [59]:
np.sum(bill)

NameError: name 'np' is not defined

In [60]:
import math

In [61]:
math.fsum(bill)

NameError: name 'bill' is not defined

In [62]:
df1.total_bill.min()

3.07

In [63]:
df1.total_bill.max()

50.81

In [64]:
df1.total_bill.mean()

19.78946280991736

In [65]:
a=df1.total_bill.mean()

In [66]:
a*242

4789.050000000001

In [67]:
df1['total_bill'].median()

17.795

In [68]:
df1['total_bill'].std()

8.930523310433504

In [69]:
df1

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
4         24.59  3.61  Female     No   Sun  Dinner     4
5         25.29  4.71    Male     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[242 rows x 7 columns]

In [70]:
df1.sex.mode()

0    Male
Name: sex, dtype: object

In [71]:
df1.sex.median()

TypeError: could not convert string to float: 'Female'

In [72]:
df1.sex

0      Female
1        Male
2        Male
4      Female
5        Male
        ...
239      Male
240    Female
241      Male
242      Male
243    Female
Name: sex, Length: 242, dtype: object

In [73]:
df1.sex.unique()

array(['Female', 'Male'], dtype=object)

In [74]:
df1.day.unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [75]:
df=pd.read_csv(r"C:\Users\Ducat\Desktop\tips (1).csv")

In [76]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68   NaN    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [77]:
# df[condition]

In [79]:
df1=df[df.tip>5]

In [80]:
df1.shape

(18, 7)

In [82]:
df.shape

(244, 7)

In [86]:
df[df.sex=='Male']

     total_bill   tip   sex smoker  day    time  size
1         10.34  1.66  Male     No  Sun  Dinner     3
2         21.01  3.50  Male     No  Sun  Dinner     3
3         23.68   NaN  Male     No  Sun  Dinner     2
5         25.29  4.71  Male     No  Sun  Dinner     4
6          8.77  2.00  Male     No  Sun  Dinner     2
..          ...   ...   ...    ...  ...     ...   ...
236       12.60  1.00  Male    Yes  Sat  Dinner     2
237       32.83  1.17  Male    Yes  Sat  Dinner     2
239       29.03  5.92  Male     No  Sat  Dinner     3
241       22.67  2.00  Male    Yes  Sat  Dinner     2
242       17.82  1.75  Male     No  Sat  Dinner     2

[157 rows x 7 columns]

In [87]:
df[df.sex=='Female']

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
11        35.26  5.00  Female     No   Sun  Dinner     3
14        14.83  3.02  Female     No   Sun  Dinner     2
16        10.33  1.67  Female     No   Sun  Dinner     3
..          ...   ...     ...    ...   ...     ...   ...
226       10.09  2.00  Female    Yes   Fri   Lunch     2
229       22.12  2.88  Female    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[87 rows x 7 columns]

In [88]:
157+87

244

In [92]:
df[(df.time=="Dinner") & (df.sex=='Female')]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
11        35.26  5.00  Female     No   Sun  Dinner     3
14        14.83  3.02  Female     No   Sun  Dinner     2
16        10.33  1.67  Female     No   Sun  Dinner     3
18        16.97  3.50  Female     No   Sun  Dinner     3
21        20.29  2.75  Female     No   Sat  Dinner     2
22        15.77  2.23  Female     No   Sat  Dinner     2
29        19.65  3.00  Female     No   Sat  Dinner     2
32        15.06  3.00  Female     No   Sat  Dinner     2
33        20.69  2.45  Female     No   Sat  Dinner     4
37        16.93  3.07  Female     No   Sat  Dinner     3
51        10.29  2.60  Female     No   Sun  Dinner     2
52        34.81  5.20  Female     No   Sun  Dinner     4
57        26.41  1.50  Female     No   Sat  Dinner     2
66        16.45  2.47  Female     No   Sat  Dinner     2
67         3.07  1.00  Female    Yes   Sat  Dinner     1
71        17.07  3.00  Female     No   Sat  Dinner     3
72        26.86  3.14  Female    Yes   Sat  Dinner     2
73        25.28  5.00  Female    Yes   Sat  Dinner     2
74        14.73  2.20  Female     No   Sat  Dinner     2
92         5.75  1.00  Female    Yes   Fri  Dinner     2
93        16.32  4.30  Female    Yes   Fri  Dinner     2
94        22.75  3.25  Female     No   Fri  Dinner     2
100       11.35  2.50  Female    Yes   Fri  Dinner     2
101       15.38  3.00  Female    Yes   Fri  Dinner     2
102       44.30  2.50  Female    Yes   Sat  Dinner     3
103       22.42  3.48  Female    Yes   Sat  Dinner     2
104       20.92  4.08  Female     No   Sat  Dinner     2
109       14.31  4.00  Female    Yes   Sat  Dinner     2
111        7.25  1.00  Female     No   Sat  Dinner     1
114       25.71  4.00  Female     No   Sun  Dinner     3
115       17.31  3.50  Female     No   Sun  Dinner     2
155       29.85  5.14  Female     No   Sun  Dinner     5
157       25.00  3.75  Female     No   Sun  Dinner     4
158       13.39  2.61  Female     No   Sun  Dinner     2
162       16.21  2.00  Female     No   Sun  Dinner     3
164       17.51  3.00  Female    Yes   Sun  Dinner     2
168       10.59  1.61  Female    Yes   Sat  Dinner     2
169       10.63  2.00  Female    Yes   Sat  Dinner     2
178        9.60  4.00  Female    Yes   Sun  Dinner     2
186       20.90  3.50  Female    Yes   Sun  Dinner     3
188       18.15  3.50  Female    Yes   Sun  Dinner     3
209       12.76  2.23  Female    Yes   Sat  Dinner     2
213       13.27  2.50  Female    Yes   Sat  Dinner     2
214       28.17  6.50  Female    Yes   Sat  Dinner     3
215       12.90  1.10  Female    Yes   Sat  Dinner     2
219       30.14  3.09  Female    Yes   Sat  Dinner     4
229       22.12  2.88  Female    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [93]:
df[(df.time=="Dinner") & (df.sex=='Female')].shape

(52, 7)

In [96]:
df2=df[(df.sex=='Female')]

In [98]:
df2.total_bill.sum()

1570.9499999999996

In [101]:
df.total_bill.sum()

4827.77

In [103]:
df[df.sex=='Male'].total_bill.sum()

3256.8199999999997

In [105]:
df3=df[df.sex=='Male']

In [108]:
df[df.sex=='Male'].total_bill.sum()

3256.8199999999997

In [109]:
df[(df.sex=='Male')&(df.time=='Lunch')].total_bill.sum()

595.6

In [110]:
df[(df.sex=='Female')&(df.time=='Lunch')].total_bill.sum()

571.87

In [111]:
df[(df.sex=='Female')&(df.time=='Lunch')].tip.sum()

90.4

In [112]:
df[(df.sex=='Male')&(df.time=='Lunch')].tip.sum()

95.11

In [113]:
df[(df.sex=='Female')&(df.time=='Dinner')].tip.sum()

156.10999999999999

In [114]:
df[(df.sex=='Male')&(df.time=='Dinner')].tip.sum()

384.69000000000005

In [120]:
# df[(df.sex=='Male')&(df.day==df.day.value_counts().index[0])].total_bill.sum()
df[(df.sex=='Male')&(df.day=='Sat')].total_bill.sum()

1227.35

In [116]:

df.day.value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [117]:
df.day.value_counts().index

Index(['Sat', 'Sun', 'Thur', 'Fri'], dtype='object')

In [118]:
df.day.value_counts().index[0]

'Sat'

In [121]:
df.total_bill.value_counts()

13.42    3
13.81    2
15.98    2
17.92    2
10.07    2
        ..
24.71    1
21.16    1
28.97    1
22.49    1
18.78    1
Name: total_bill, Length: 229, dtype: int64

In [124]:
df[(df.sex=='Female')&((df.time=='Dinner')|(df.smoker=='No'))]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
11        35.26  5.00  Female     No   Sun  Dinner     3
14        14.83  3.02  Female     No   Sun  Dinner     2
16        10.33  1.67  Female     No   Sun  Dinner     3
..          ...   ...     ...    ...   ...     ...   ...
223       15.98  3.00  Female     No   Fri   Lunch     3
229       22.12  2.88  Female    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[77 rows x 7 columns]

In [125]:
df[df.smoker=='No'].total_bill.sum()

2897.4299999999994

In [126]:
df[df.smoker=='Yes'].total_bill.sum()

1930.3400000000001

In [127]:
1930/df.total_bill.sum()

0.3997704944518898

In [18]:
df

NameError: name 'df' is not defined

In [19]:
print("Sat :",df[(df.day=='Sat')].total_bill.sum(),"size :",df[df.day=='Sat'].shape[0],df[(df.day=='Sat')].total_bill.mean())
print("Sun :",df[(df.day=='Sun')].total_bill.sum(),"size :",df[df.day=='Sun'].shape[0],df[(df.day=='Sun')].total_bill.mean())
print("Thur :",df[(df.day=='Thur')].total_bill.sum(),"size :",df[df.day=='Thur'].shape[0],df[(df.day=='Thur')].total_bill.mean())
print("Fri :",df[(df.day=='Fri')].total_bill.sum(),"size :",df[df.day=='Fri'].shape[0],df[(df.day=='Fri')].total_bill.mean())

NameError: name 'df' is not defined

In [20]:
df[(df.day=='Sat')].total_bill.mean()

NameError: name 'df' is not defined

To get the insight of the data

> group by -->preferred by database consultant

> pivot table --> preferred by excel consultant

In [21]:
import pandas as pd

In [23]:
df1=pd.read_csv(r"C:\Users\Ducat\Desktop\tips (1).csv")
df1=df1.dropna()

In [24]:
df1.groupby(by='sex').count()

        total_bill  tip  smoker  day  time  size
sex
Female          87   87      87   87    87    87
Male           155  155     155  155   155   155

In [25]:
df1.groupby(by='day').count()

      total_bill  tip  sex  smoker  time  size
day
Fri           19   19   19      19    19    19
Sat           87   87   87      87    87    87
Sun           74   74   74      74    74    74
Thur          62   62   62      62    62    62

In [26]:
df1.groupby(by='sex').total_bill.agg(['sum','mean','std','min','max','median'])

            sum       mean       std   min    max  median
sex
Female  1570.95  18.056897  8.009209  3.07  44.30   16.40
Male    3218.10  20.761935  9.291930  7.25  50.81   18.35

In [27]:
df1

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
4         24.59  3.61  Female     No   Sun  Dinner     4
5         25.29  4.71    Male     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[242 rows x 7 columns]

In [33]:
df1.groupby(by='sex').tip.agg(['mean','std','min','max'])

            mean       std  min   max
sex
Female  2.833448  1.159495  1.0   6.5
Male    3.095484  1.495856  1.0  10.0

In [36]:
df1.groupby(by='day').total_bill.agg(['sum','mean','max','min','std','count'])

          sum       mean    max   min       std  count
day
Fri    325.88  17.151579  40.17  5.75  8.302660     19
Sat   1778.40  20.441379  50.81  3.07  9.480419     87
Sun   1588.44  21.465405  48.17  7.25  8.917062     74
Thur  1096.33  17.682742  43.11  7.51  7.886170     62

In [49]:
df1[(df1.day=='Fri')&(df1.total_bill>20)].shape
(6/19)*100

31.57894736842105

In [50]:
df1[(df1.day=='Sat')&(df1.total_bill>20)].shape
(38/87)*100

43.67816091954023

In [51]:
df1[(df1.day=='Sun')&(df1.total_bill>20)].shape
(36/74)*100

48.64864864864865

In [52]:
df1[(df1.day=='Thur')&(df1.total_bill>20)].shape
(16/62)*100

25.806451612903224

In [54]:
df2=pd.read_csv(r"C:\Users\Ducat\Desktop\Titanic-Dataset (1).csv")

In [56]:
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [60]:
df2.pivot_table(index=['Pclass','Sex'],values='Fare',aggfunc=['count','max'])

              count       max
               Fare      Fare
Pclass Sex
1      female    94  512.3292
       male     122  512.3292
2      female    76   65.0000
       male     108   73.5000
3      female   144   69.5500
       male     347   69.5500

In [61]:
94+122+76+108+144+347

891

In [64]:
df2.Fare.max()

512.3292

In [68]:
df2[(df2.Sex=='female')&(df2.Fare>512)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C

In [69]:
df2[(df2.Sex=='male')&(df2.Fare>512)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

In [71]:
df2[df2.Fare==0].shape

(15, 12)